app/Models/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'user1'
 LIMIT 1
---
    public function verify_login($usuario, $senha)
    {
        //primeiro vamos procurar com nome de usuario
        $usuario = $this->where('usuario', $usuario)->first();